#+BEGIN_COMMENT
.. title: perlのワンライナー
.. slug: perl-oneliner
.. date: 2017-09-03 14:59:02 UTC+09:00
.. tags: perl, コード置き場
.. category:
.. link:
.. description:
.. type: text
#+END_COMMENT

便利だったので。

{{{TEASER_END}}}

まずサンプルファイルを作る。

#+BEGIN_SRC sh :exports both :results output
echo "人, ひと, hito, 名詞\n名前, なまえ, namae, 名詞\n歌う, うたう, utau, 動詞\n走る, はしる, hasiru, 動詞\n高い, たかい, takai, 形容詞\n甘い, あまい, amai, 形容詞" > sample.txt
cat sample.txt
#+END_SRC

#+RESULTS:
: 人, ひと, hito, 名詞
: 名前, なまえ, namae, 名詞
: 歌う, うたう, utau, 動詞
: 走る, はしる, hasiru, 動詞
: 高い, たかい, takai, 形容詞
: 甘い, あまい, amai, 形容詞

そしてワンライナーを実行する。

ここでは正規表現を使った置換をしている。Perlをよく知らないのでこれぐらいしかできない。

#+BEGIN_SRC sh :exports both :results output
perl -pe "s/(.+), (.+), (.+), (.+)/\4, \1, \2, \3/g" sample.txt
#+END_SRC

#+RESULTS:
: 名詞, 人, ひと, hito
: 名詞, 名前, なまえ, namae
: 動詞, 歌う, うたう, utau
: 動詞, 走る, はしる, hasiru
: 形容詞, 高い, たかい, takai
: 形容詞, 甘い, あまい, amai

オプションの説明

|   | オプション | 説明                                                                                      |
| / | <>         | <>                                                                                        |
|---+------------+-------------------------------------------------------------------------------------------|
|   | -e         | 引数をプログラムと見なして実行する                                                        |
|---+------------+-------------------------------------------------------------------------------------------|
|   | -n         | ファイル (またはstdin) から入力を読み取るループを、実行するプログラムの一番外側に追加する |
|---+------------+-------------------------------------------------------------------------------------------|
|   | -p         | -n と同じ処理をし、加えて処理された行を出力する (jupyter notebookの挙動に似てる)          |
|---+------------+-------------------------------------------------------------------------------------------|
|   | -i         | 実行結果をstdoutに出力するのではなくファイルに書き戻す                                    |


* 参考にしたサイト

- [[http://www.megasoft.co.jp/mifes/seiki/index_r1.html][正規表現サンプル集]]
- [[http://qiita.com/takc923/items/8654d69008e921c9c9fb#-p%E3%82%AA%E3%83%97%E3%82%B7%E3%83%A7%E3%83%B3%E3%81%AE%E8%A3%9C%E8%B6%B3][環境に依存しないワンライナーを書くならsedよりperlの方がいい - Qiita]]
- [[http://blog.livedoor.jp/dankogai/archives/51026593.html][404 Blog Not Found:perl - perl - ワンライナーの書き方入門]]
